import styled from "styled-components";
import { Link } from "react-router-dom";
import { BsFacebook } from "react-icons/bs";
import { AiFillMail } from "react-icons/ai";
import { FcPrint } from "react-icons/fc";

import bp from "../../../assets/images/blood_pressure.png";
import { HBox, VBox } from "../../../components/Containers";
import { H2, P1, P2, P3, P4 } from "../../../components/Typography";
import colors from "../../../config/colors";

const Image = styled.img`
    width: 100%;
`

const ContentBody = ({title, isMobile}) => {
    return (
        <VBox>
            <H2 
                className={isMobile ? "bold my-2" : "bold my-6"} 
                justify="center" 
                align="center" 
                style={{ color: colors.green }}
            >
                {title}
            </H2>
            <P2 className={isMobile ? "mb-1" : "mb-3"}>
                হঠাৎ করে কানে পানি যেতেই পারে। এতে ভয়ের কিছু নেই। অনেকেই মনে করেন, কানে পানি গেলেই কানের ক্ষতি
                হয়ে যাবে। এই ধারণাটির কোনো বৈজ্ঞানিক ভিত্তিই নেই। সুস্থ কানে পানি গেলে আদতে কোনো অসুস্থতাই সৃষ্টি হয় 
                না। তবে সুস্থ কানে পানি গেলে বের করার চেষ্টা করতে গেলেই বাধে বিপত্তি।
            </P2>
            <P1 className={isMobile ? "bold mb-1" : "bold mb-3"}>যেসব কাজ থেকে বিরত থাকতে হবে:</P1>
            <P2 className={isMobile ? "ml-3 mb-1" : "ml-6 mb-3"}>
                <ul>
                    <li>কানে পানি গেলে ভয় পাওয়া যাবে না।</li>
                    <li>কান থেকে পানি বের করার কোনো চেষ্টাও করা যাবে না।</li>
                    <li>নাক চেপে ধরে কান দিয়ে বাতাস বের করার চেষ্টা করেন অনেকেই। প্রচলিত বিশ্বাস হলো এভাবে বাতাসের চাপে 
                        কানের পানি বেরিয়ে আসবে। এ ধরনের প্রচেষ্টায় আমাদের মধ্যকর্ণের বিভিন্ন অংশ ভেতর থেকে আহত কিংবা 
                        ক্ষতিগ্রস্ত হওয়ার আশঙ্কা থাকে। এমনকি কানের পর্দা ছিদ্রও হয়ে যেতে পারে। অথচ কানে ঢোকা পানি এমন 
                        কোনো ক্ষতিই করত না।</li>
                    <li>অনেকে মনে করেন, কানে বেশি পরিমাণ পানি দিলে আগে ঢুকে যাওয়া পানিসহ পুরো পানিটাই কান থেকে সহজে 
                        বেরিয়ে আসবে। এ জন্য কানে আরও পানি ঢুকিয়ে দেন। এই ধারণাটিও কিন্তু ভুল। এতেও হিতে বিপরীত হতে পারে। 
                        তাই এমনটা করবেন না।</li>
                    <li>কটনবাড দিয়ে কানের পানি বের করার বা কানের অস্বস্তি দূর করার চেষ্টা করা যাবে না। 
                        কটনবাড কানের জন্য ভীষণ ক্ষতিকর।</li>
                    <li>কেউ কেউ আবার লাফিয়ে কিংবা মাথা ঝাঁকিয়ে কানের পানি বের করার চেষ্টা করেন। এমনটাও করা উচিত 
                        নয়।</li>
                </ul>
            </P2>
            <Image src={bp} className="mb-3"/>
            <P1 className={isMobile ? "bold mb-1" : "bold mb-3"}>চিকিৎসকের কাছে কখন যাবেন</P1>
            <P2 className={isMobile ? "mb-1" : "mb-3"}>কানে পানি যাওয়াটা কোনো সমস্যা নয়। এর জন্য কোনো চিকিৎসার প্রয়োজন নেই। তবে যাঁদের কানে আগে থেকে 
                সংক্রমণ কিংবা অন্য কোনো সমস্যা রয়েছে, তাঁদের কানে পানি ঢুকলে কান ভারী লাগতে পারে বা কানে অস্বস্তি হতে 
                পারে, ঠিক যেমন কানে ময়লা জমে থাকলে পানি ঢোকার পর তা ফুলে গিয়ে কান ভারী অনুভূত হতে পারে। কোনো 
                কোনো ক্ষেত্রে দেখা যায়, কানে পানি যাওয়ার পর কান থেকে পুঁজও পড়ছে। এসব ক্ষেত্রে কানে পানি ঢোকাটাকেই 
                সমস্যার মূল কারণ বলে চিহ্নিত করা হয়, যা একদমই ঠিক নয়। বরং বুঝতে হবে, কানে আগে থেকেই একটি সমস্যা 
                ছিল। এ ধরনের কোনো উপসর্গ দেখা দিলে তখনো কিন্তু কানের পানি বের করার চেষ্টা করা যাবে না। বরং নাক কান 
                গলা বিশেষজ্ঞের কাছে গিয়ে কানের মূল সমস্যাটি নির্ণয় করে সেটির চিকিৎসা নিতে হবে।</P2>
            <P1 className={isMobile ? "bold mb-1" : "bold mb-3"}>তবে খেয়াল রাখুন</P1>
            <P2 className={isMobile ? "mb-1" : "mb-3"}>যদি কারও কানে প্রদাহ থাকে বা ব্যাকটেরিয়া বা ছত্রাকজনিত কোনো সংক্রমণ থাকে, তাঁদের কানে যাতে পানি না 
                ঢোকে, সেদিকে অবশ্যই খেয়াল রাখতে হবে। কারও যদি প্রায়ই কান চুলকায় বা ‘কানপাকা’ সমস্যা থেকে থাকে, তাঁদের 
                কানে যাতে পানি না ঢোকে, সে বিষয়ে যত্নশীল হতে হবে।</P2>
            <HBox className={isMobile ? "my-2" : "my-4"}>
                <P2 className="mr-2">পোস্ট শেয়ার করুন:</P2>
                <P2 className="mr-2" style={{ fontSize: "20px" }}><BsFacebook style={{color: colors.blue}}/></P2>
                <P2 className="mr-2" style={{ fontSize: "23px" }}><AiFillMail style={{color: colors.lightBlack}}/></P2>
                <P2 className="mr-2" style={{ fontSize: "23px" }}><FcPrint style={{color: colors.lightBlack}}/></P2>
            </HBox>
        </VBox>
    )
}

export default ContentBody